/*
 /$$      /$$  /$$$$$$  /$$     /$$ /$$$$$$  /$$$$$$$               /$$$$$$  /$$        /$$$$$$  /$$   /$$ /$$$$$$$ 
| $$$    /$$$ /$$__  $$|  $$   /$$//$$__  $$| $$__  $$             /$$__  $$| $$       /$$__  $$| $$  | $$| $$__  $$
| $$$$  /$$$$| $$  \ $$ \  $$ /$$/| $$  \ $$| $$  \ $$            | $$  \__/| $$      | $$  \ $$| $$  | $$| $$  \ $$
| $$ $$/$$ $$| $$$$$$$$  \  $$$$/ | $$  | $$| $$$$$$$/            | $$      | $$      | $$  | $$| $$  | $$| $$  | $$
| $$  $$$| $$| $$__  $$   \  $$/  | $$  | $$| $$__  $$            | $$      | $$      | $$  | $$| $$  | $$| $$  | $$
| $$\  $ | $$| $$  | $$    | $$   | $$  | $$| $$  \ $$            | $$    $$| $$      | $$  | $$| $$  | $$| $$  | $$
| $$ \/  | $$| $$  | $$    | $$   |  $$$$$$/| $$  | $$            |  $$$$$$/| $$$$$$$$|  $$$$$$/|  $$$$$$/| $$$$$$$/
|__/     |__/|__/  |__/    |__/    \______/ |__/  |__/             \______/ |________/ \______/  \______/ |_______/ 
                                                                                                                    
*/
module.exports = {
  bot: {
    TOKEN: "",                // توكن البوت
    botID: "",                // آيدي البوت
    callbackURL: "http://هنا ip/login", // رابط الكول باك
    clientSECRET: "",         // السكريت الخاص بتطبيق ديسكورد
    ClientId: "",             // آيدي تطبيق البوت
    clientrole: "",           // آيدي رتبة العملاء
    done: "",                 // آيدي روم (تمّت العملية)
    fedroom: "",              // آيدي روم الفيدباك
    GuildId: "",              // آيدي السيرفر
    line: "",                 // رابط خط السيرفر
    owners: ["", ""],         // أونرز البوت
    prefix: "$",              // البريفكس
    serverinvte: "https://discord.gg/mayor", // رابط الدعوة للسيرفر
    stockimg: "",             // رابط صورة ستوك الأعضاء
    supportimg: "",           // رابط صورة تذكرة الدعم الفني
    TheLinkVerfy: "",         // رابط الأوثرايز بالصلاحيات
    ticketimg: "",            // رابط صورة تذكرة الشراء
    TraId: "",                // الشخص الذي يتم التحويل له كريديت
  },

  website: {
    PORT: "6075",             // بورت الموقع
  }
}
